src/cf/Catalogs/Нумераторы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Нумераторы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПропущенныеНомера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначенияНумераторов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НезависимаяНумерацияПоВидуДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НезависимаяНумерацияПоВопросуДеятельности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НезависимаяНумерацияПоГрифуДоступа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НезависимаяНумерацияПоОрганизациям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НезависимаяНумерацияПоПодразделению</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НезависимаяНумерацияПоПроекту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НезависимаяНумерацияПоСвязанномуДокументу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НезависимаяНумерацияПоТематике</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НезависимаяНумерацияПоУзлуКОД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьНумераторов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пример</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСвязи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыСвязей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматНомера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТТС_НезависимаяНумерацияПоНаправлению</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/Нумераторы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает структуру полей Нумераторов
//
// Возвращаемое значение:
//   Структура:
//   *  Наименование - Строка
//   *  Периодичность - ПеречислениеСсылка.ПериодичностьНумераторов
//   *  ФорматНомера - Строка
//   *  НезависимаяНумерацияПоВидуДокумента - Булево
//   *  НезависимаяНумерацияПоВопросуДеятельности - Булево
//   *  НезависимаяНумерацияПоГрифуДоступа - Булево
//   *  НезависимаяНумерацияПоОрганизациям - Булево
//   *  НезависимаяНумерацияПоПодразделению - Булево
//   *  НезависимаяНумерацияПоПроекту - Булево
//   *  НезависимаяНумерацияПоТематике - Булево
//   *  НезависимаяНумерацияПоУзлуКОД - Булево
//   *  ТипСвязи - СправочникСсылка.ТипыСвязей
//   *  Назначение - ПеречислениеСсылка.НазначенияНумераторов
//
Функция ПолучитьСтруктуруНумераторов() Экспорт
	
	ПараметрыНумераторов = Новый Структура;
	ПараметрыНумераторов.Вставить("Наименование");
	ПараметрыНумераторов.Вставить("Периодичность");
	ПараметрыНумераторов.Вставить("ФорматНомера");
	ПараметрыНумераторов.Вставить("НезависимаяНумерацияПоОрганизациям");
	ПараметрыНумераторов.Вставить("НезависимаяНумерацияПоСвязанномуДокументу");
	ПараметрыНумераторов.Вставить("НезависимаяНумерацияПоПодразделению");
	ПараметрыНумераторов.Вставить("НезависимаяНумерацияПоВидуДокумента");
	ПараметрыНумераторов.Вставить("НезависимаяНумерацияПоПроекту");
	ПараметрыНумераторов.Вставить("НезависимаяНумерацияПоВопросуДеятельности");
	ПараметрыНумераторов.Вставить("НезависимаяНумерацияПоТематике");
	ПараметрыНумераторов.Вставить("НезависимаяНумерацияПоГрифуДоступа");
	ПараметрыНумераторов.Вставить("НезависимаяНумерацияПоУзлуКОД");
	ПараметрыНумераторов.Вставить("ТипСвязи");
	ПараметрыНумераторов.Вставить("Назначение");
	ПараметрыНумераторов.Вставить("Пример");
	
	Возврат ПараметрыНумераторов;
	
КонецФункции

// Создает и записывает в БД Нумератор
//
// Параметры:
//  СтруктураНумератора - см. Справочники.Нумераторы.ПолучитьСтруктуруНумераторов
//
// Возвращаемое значение:
//  СправочникСсылка.Нумераторы
//
Функция СоздатьНумератор(СтруктураНумератора) Экспорт
	
	НовыйНумератор = СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(НовыйНумератор, СтруктураНумератора);
	НовыйНумератор.Записать();
	
	Возврат НовыйНумератор.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
